{
  "backend/main.mo": "Main actor implementing marketplace backend with user management (profiles, artist status), item CRUD operations, brand configuration, Stripe integration per artist, featured items, access control, and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms old actor state (single stripeConfig, userProfiles) to new structure (per-user stripeConfigs, users with isArtist flag and profiles).",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: Settings navigation link, Settings page with artist/Stripe config, CreateItemForm artist check, Stripe config moved to Settings, and React Query hooks for artist status.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components (Header, forms, admin dashboard), pages (home, browse, settings, admin), hooks (useQueries with all backend operations), and styling configuration.",
  "frontend/index.css": "Tailwind CSS base styles with custom CSS variables for light and dark themes using OKLCH color system, defining colors for UI elements like backgrounds, borders, cards, and charts.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'Artist Marketplace'.",
  "frontend/src/App.tsx": "Root application component using TanStack Router with routes for home, browse, item detail, create/edit item, settings, admin, and payment pages; includes Header, Footer, and ProfileSetupModal in root layout.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied error screen component displaying shield icon, message, and button to return home for unauthorized page access attempts.",
  "frontend/src/components/AdminDashboard.tsx": "Tabbed admin dashboard component with forms for updating platform branding (name, logo, color) and configuration (fee percentage) using brand config queries and mutations.",
  "frontend/src/components/CategoryFilter.tsx": "A filter component that displays category buttons (All, Music, Video, Images, 3D Prints, Ceramics, Paintings) and allows users to select a category to filter items.",
  "frontend/src/components/CreateItemForm.tsx": "A form component for creating new marketplace items with fields for title, description, price, category, and images, including AI-powered description generation and artist status verification.",
  "frontend/src/components/EditItemForm.tsx": "A form component for editing existing marketplace items, allowing updates to title, description, price, and category with AI-powered description generation support.",
  "frontend/src/components/Footer.tsx": "A footer component displaying About, Connect (social links), and Legal sections, plus a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "A sticky header component with navigation links (Browse, List Item, Settings, Admin), authentication button, and mobile menu support, displaying platform branding from brand config.",
  "frontend/src/components/HeroSection.tsx": "A hero banner component with background image, platform name, tagline, and call-to-action buttons for exploring the marketplace and listing items.",
  "frontend/src/components/ImageGallery.tsx": "An image carousel component with navigation arrows and thumbnail strip for displaying multiple item images, falling back to a placeholder if no images exist.",
  "frontend/src/components/ItemGrid.tsx": "A responsive grid component that displays marketplace items as cards with image, title, description, category badge, creator name, and price.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name for profile setup, preventing dismissal until completed.",
  "frontend/src/components/PurchaseButton.tsx": "React component that renders a purchase button for an item, creates a Stripe checkout session via mutation hook, and redirects to the Stripe payment URL.",
  "frontend/src/components/StripePaymentSetup.tsx": "Admin configuration form for setting up Stripe payment processing with secret key and allowed countries, showing configuration status and allowing updates.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, artist status, items CRUD, brand config, Stripe configuration, and checkout session creation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm artisan color palette for light and dark modes, defining CSS variables for UI theming and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page displaying Stripe payment setup and admin dashboard, with access control checking if caller is admin.",
  "frontend/src/pages/BrowsePage.tsx": "Marketplace browsing page with category filtering that displays items in a grid, fetching all items or filtered by selected category.",
  "frontend/src/pages/CreateItemPage.tsx": "Page for creating new marketplace items, requiring authentication and rendering the CreateItemForm component.",
  "frontend/src/pages/EditItemPage.tsx": "Page for editing existing items with access control checking if user is the creator or admin, rendering EditItemForm for the specified item ID.",
  "frontend/src/pages/HomePage.tsx": "Displays the hero section and a grid of the first 8 featured items from the marketplace, with loading state handling.",
  "frontend/src/pages/ItemDetailPage.tsx": "Shows detailed item information including image gallery, description, price, creator profile, and purchase/edit/delete actions based on user permissions (creator or admin).",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a cancellation message when payment fails, with links to browse marketplace or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a success confirmation after completed payment, with options to continue shopping or return home.",
  "frontend/src/pages/SettingsPage.tsx": "User settings page displaying profile information, artist mode toggle, and Stripe payment setup for artists; requires authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, container settings, font families (Inter/Playfair Display), and animation utilities.",
  "project_state.json": "Project metadata defining an artist marketplace platform with Stripe integration, 10% platform fee, multi-photo uploads, and a known issue where item posting fails with 'user not found' error."
}