{
  "backend/main.mo": "Main backend actor implementing marketplace functionality with user profiles, artist status management, item CRUD operations, Stripe configuration, access control, brand configuration, and blob storage for images.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of Stripe configuration checks in CreateItemForm component before allowing item creation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and configuration files describing the marketplace UI structure and functionality.",
  "frontend/index.css": "Global Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color system.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with all routes (home, browse, item detail, create/edit, settings, admin, payment success/failure) and root layout with header, footer, and profile setup modal.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied error screen component displayed when users lack permissions to view restricted pages.",
  "frontend/src/components/AdminDashboard.tsx": "Tabbed admin dashboard component for managing platform branding (name, logo, color) and configuration (fee percentage) with form inputs and mutation hooks.",
  "frontend/src/components/CategoryFilter.tsx": "Category filter component with buttons for all item categories (music, video, images, prints, ceramics, paintings) plus an 'All' option.",
  "frontend/src/components/CreateItemForm.tsx": "Form component for creating new marketplace items with fields for title, description, price, category, and image uploads; includes AI-powered description generation and validates artist/Stripe status before submission.",
  "frontend/src/components/EditItemForm.tsx": "Form component for editing existing marketplace items, allowing updates to title, description, price, and category with AI description generation support.",
  "frontend/src/components/Footer.tsx": "Footer component displaying About, Connect (social links), and Legal sections with a Caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Navigation header with platform branding, authentication controls, and links to Browse, List Item, Settings, and Admin (conditional on user role); includes mobile menu support.",
  "frontend/src/components/HeroSection.tsx": "Landing page hero section with background image, platform name, tagline, and call-to-action buttons for browsing and listing items.",
  "frontend/src/components/ImageGallery.tsx": "Image carousel component with navigation controls and thumbnail strip for displaying multiple item images or a placeholder.",
  "frontend/src/components/ItemGrid.tsx": "Grid layout component displaying marketplace items as cards with image, title, description, category badge, creator name, and price; links to individual item pages.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog prompting new users to enter their name for profile setup; prevents dismissal until completed.",
  "frontend/src/components/PurchaseButton.tsx": "Button component that initiates Stripe checkout session for purchasing an item and redirects to payment page.",
  "frontend/src/components/StripePaymentSetup.tsx": "React component for configuring Stripe payment settings, including secret key and allowed countries, with form validation and status display.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, artist status, items, categories, brand config, shopping cart, and Stripe configuration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm artisan color palette for light and dark modes, plus utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that checks admin permissions and displays Stripe payment setup and admin controls, or shows access denied.",
  "frontend/src/pages/BrowsePage.tsx": "Marketplace browsing page with category filtering that displays items in a grid layout with loading states.",
  "frontend/src/pages/CreateItemPage.tsx": "Page for creating new marketplace items, requiring authentication and rendering the CreateItemForm component.",
  "frontend/src/pages/EditItemPage.tsx": "Page for editing existing items, verifying user is creator or admin before allowing access to the EditItemForm.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying a hero section and grid of featured marketplace items with loading state.",
  "frontend/src/pages/ItemDetailPage.tsx": "Displays detailed item information with image gallery, purchase button, creator profile, and admin/creator controls for editing and deleting items. Includes category badges, pricing, and timestamp display.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple payment cancellation page with error icon, message, and navigation buttons to browse marketplace or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment confirmation page with success icon, thank you message, and navigation options to continue shopping or return home.",
  "frontend/src/pages/SettingsPage.tsx": "User settings page displaying profile information, artist mode toggle, and Stripe payment setup component for artists. Requires authentication and shows loading states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, font families (Inter/Playfair Display), border radius variables, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata defining an artist marketplace platform with Stripe integration, 10% platform fee, multi-media support, and admin controls. Documents a known issue with item posting failing due to user authentication/lookup problems."
}