{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Require Stripe setup before item creation with profile completion guidance",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Add query hook to fetch current user's Stripe configuration status",
      "acceptanceCriteria": [
        "New React Query hook getUserStripeConfig is created that calls the backend getUserStripeConfig method",
        "The hook returns the user's Stripe configuration if it exists, or null/undefined if not configured",
        "The hook is properly typed with TypeScript interfaces matching the backend StripeConfig type",
        "The hook uses the actor instance from useActor and handles authentication state correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook getUserStripeConfig that fetches the current user's Stripe configuration status by calling the backend actor method. The hook should return null if Stripe is not configured, use proper TypeScript typing for StripeConfiguration interface, depend on the actor from useActor, and follow the same patterns as existing query hooks in this file (e.g., useGetCallerUserProfile). Include proper error handling and enabled state management."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Update CreateItemForm to check Stripe configuration before allowing item creation",
      "acceptanceCriteria": [
        "CreateItemForm checks if the current user has Stripe configuration before rendering the item creation form",
        "If Stripe is not configured, the form displays a clear message explaining that Stripe setup is required",
        "The message includes a clickable link or button that navigates to the Settings page (/settings)",
        "The actual item creation form fields are hidden or disabled until Stripe configuration is complete",
        "The check uses the existing getUserStripeConfig query hook to determine Stripe configuration status"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CreateItemForm.tsx",
          "operation": "modify",
          "description": "Add Stripe configuration check before allowing item creation. Import and use the getUserStripeConfig hook from useQueries.ts. If Stripe is not configured (returns null), display a user-friendly message explaining that Stripe setup is required to create items, with a prominent link/button to navigate to /settings. Hide or disable the actual form fields (title, description, price, category, images) until Stripe configuration is complete. Preserve the existing isArtist check and validation logic. Use TanStack Router's Link component for navigation to /settings. Display loading state while checking Stripe configuration status."
        }
      ]
    }
  ]
}